{
  "personal_info": {
    "name": "Wellington do Nascimento",
    "photo_url": "https://avatars.githubusercontent.com/u/42657376?v=4",
    "linkedin_qr_code_url": "El PDF contiene un código QR que probablemente enlaza al perfil de LinkedIn.",
    "linkedin": "https://linkedin.com/in/wellington-do-nascimento",
    "website": "https://wellnas.dev",
    "phone": "+55 (11) 94201-8873",
    "email": "dev.wellnascimento@gmail.com",
    "age": "26 años (10/05/1999)",
    "nationality": "Brasileño",
    "location": "Cavalcanti, Río de Janeiro/RJ"
  },
  "objective": "DESARROLLADOR EN EL ÁREA DE TI",
  "roles": [
    "DESARROLLADOR FULL STACK",
    "FRONT-END",
    "BACK-END",
    "MÓVIL"
  ],
  "stack": [
    "NODE",
    "JAVASCRIPT",
    "REACT",
    "NEXT.JS",
    "VUE",
    "C#",
    ".NET CORE",
    "JAVA"
  ],
  "qualifications": {
    "summary": "Más de 12 años de experiencia profesional en el área de desarrollo full stack, en los segmentos de experiencia de usuario, gestión de proyectos, diseño, prototipado, base de datos y programación back-end.",
    "skills": [
      "Facilidad de aprendizaje, autodidacta, proactivo, receptivo, entregas de valor y comunicación no violenta.",
      "Sólido conocimiento y actuación con Node.js, React, Next.js y CSS/SASS.",
      "Amplios conocimientos en sitios web, aplicaciones móviles, experiencia de usuario y diseño responsivo.",
      "Vasta experiencia y habilidad en desarrollo front-end y back-end."
    ]
  },
  "about": {
    "education": "Formación: Educación Superior - Ingeniería Informática (prev. 2027/Q2)",
    "languages": "Portugués, inglés (C1), español (B1), italiano (A1) y japonés (A2)",
    "development_areas": "Sitios web, diseño responsivo, bases de datos, servidores, infraestructura, nube, VM, automatización, móvil, UI/UX..."
  },
  "certifications": [
    {
      "title": "Desarrollador Full Stack",
      "provider": "RECODE Pro",
      "hours": "540h"
    },
    {
      "title": "Arquitectura de Computadoras",
      "provider": "Descomplica",
      "hours": "160h"
    },
    {
      "title": "Trayectoria Frontend",
      "provider": "Scrimba",
      "hours": "72h"
    },
    {
      "title": "Trayectoria de I.A.",
      "provider": "Scrimba",
      "hours": "72h"
    },
    {
      "title": "Dart & Flutter",
      "provider": "Alura",
      "hours": "48h"
    },
    {
      "title": "Juegos Unity 3D",
      "provider": "Udemy",
      "hours": "128h"
    },
    {
      "title": "jQuery",
      "provider": "Alura",
      "hours": "10h"
    },
    {
      "title": "Trayectoria Full Stack",
      "provider": "curso.dev",
      "hours": "00"
    },
    {
      "title": "Estrategias UX",
      "provider": "Alura",
      "hours": "8h"
    },
    {
      "title": "UX Básico",
      "provider": "Alura",
      "hours": "32h"
    },
    {
      "title": "React & TypeScript",
      "provider": "Alura",
      "hours": "12h"
    },
    {
      "title": "Cumplimiento y riesgos",
      "provider": "MAG Group",
      "hours": "12h"
    },
    {
      "title": "Seguridad IT",
      "provider": "Alura",
      "hours": "12h"
    },
    {
      "title": "Ley LGPD (GDPR)",
      "provider": "Bradesco",
      "hours": "2h"
    },
    {
      "title": "Gestión de Marketing",
      "provider": "SEST SENAT",
      "hours": "30h"
    }
  ],
  "experience": [
    {
      "company": "DevLand (by ESX)",
      "period": "07/2022 - 03/2025",
      "location": "São Paulo, SP, Brasil - Remoto",
      "summary": "Actuación en consultoría, prestando servicios de desarrollo de software.",
      "roles": [
        {
          "title": "Desarrollador back-end (.NET C# / Angular) - Grupo MAG",
          "period": "05/2024-03/2025",
          "details": "Reportando a los líderes del equipo en el cliente y al líder técnico en la consultoría. Responsable por el desarrollo de APIs para comunicación con la base de datos del cliente, desarrollo de interfaces para el uso de esos datos en un equipo integrado de desarrollo (equipo único) compuesto por aproximadamente 10 miembros, con ceremonias diarias siguiendo la metodología ágil SCRUM, proactividad en resolución de problemas, idealización, participación, implementación de nuevas funcionalidades, automatización de procesos, autodidactismo, sistemas de e-commerce, proceso de desarrollo y despliegue.",
          "technologies": [".NET Framework", "Selenium", "SQL Server", "Azure", "MS Power Automate", "C#", "Angular.js"]
        },
        {
          "title": "Desarrollador front-end (VTEX / React) - RESERVA (Grupo AR&CO.)",
          "period": "01/2023 - 04/2024",
          "details": "Responsable de toda la navegación y experiencia del usuario en el e-commerce de la tienda minorista textil Reserva, actuando directamente con VTEX.IO, React y otros frameworks para garantizar la calidad y exigencias de la entrega. Actuando directamente en demandas principales del sitio como página inicial, sistema de búsqueda y actividades puntuales, como ajustes en el back-end, prototipado en Figma, etc. Actuación con Master Data, VTEX CLI, JavaScript ES6, React, SASS, APIs y ampliación de funcionalidades para otras tiendas del grupo AR&CO, como BAW Clothing.",
          "technologies": ["Google Analytics", "Serverless", "SQL Queries", "React", "JavaScript", "TypeScript", "Node", "Knockout.js", "Jest (Tests Unitarios)", "Webpack", "PWA", "React Native", "jQuery", "VTEX.IO", "VTEX CLI", "CSS/SASS", "Google Tag Manager", "Microsoft Clarity", "web:eyez"]
        },
        {
          "title": "Desarrollador Full Stack - DevLand (by ESX)",
          "details": "Actuación en frentes internas de la empresa como uno de los primeros desarrolladores del proyecto para terceros, único responsable técnico por el desarrollo del sistema web y landing page de obtención de clientes potenciales de la empresa, voluntario técnico para desbloqueo de desarrolladores junior/pleno en los equipos de la empresa, además de participar en iniciativas de DevLand como las apps boutSex y HYLA App.",
          "technologies": ["Dart", "Flutter", "Google Firebase", "Google Analytics", "Serverless", "Vue", "Nuxt3", "React", "JavaScript", "jQuery", "CSS/SASS", "Google Tag Manager"]
        }
      ]
    },
    {
      "company": "Desarrollador Freelance",
      "period": "2011-2022",
      "location": "Guarulhos, SP, Brasil - Remoto",
      "summary": "Actuación de punta a punta para resolución de diversas demandas de clientes.",
      "roles": [
        {
          "title": "Desarrollador full-stack / Atención",
          "period": "05/2011-06/2022",
          "details": "Creación de sitios web, diseño web, creación y manipulación de imágenes, consultoría y desarrollo de identidades visuales y marcas, sistemas de automatización y autoservicio integrados al sitio web, Discord y WhatsApp, entre otras demandas donde tenía conocimiento o \"aprendía haciendo\" en pro del desarrollo de mi antigüedad y de la entrega de valor al cliente. También creé proyectos por cuenta propia con fines lucrativos o simplemente ayudar mientras mejoraba codificando.",
          "success_cases": "Casos de éxito: La Luna Luana (diseño de logo), \"Mi Loja, Tu Loja\" (WordPress), Deltavese (servidor)...",
          "technologies": ["HTML", "CSS", "PHP", "JavaScript", "jQuery", "MySQL", "MongoDB", "Node.js", "Photoshop", "InDesign", "React", "C#", "Oracle Cloud", "AWS", "Java", "Spring Boot", "Vue", "Nuxt3", "WordPress"]
        }
      ]
    }
  ],
  "recommendations": [
    {
      "author": "Thúlio Gamarano",
      "context": "trabajaba en el mismo equipo y era senior en relación a Wellington",
      "text": "Tuve la oportunidad de trabajar con Wellington por poco más de un año en Reserva, en un equipo dinámico y con alto nivel de exigencia técnica y estética. Desde el principio, demostró un excelente dominio en CSS y una mirada aguda para detalles visuales, garantizando que sus entregas siempre fueran fieles al diseño, responsivas y con óptimo rendimiento. Tiene un sentido estético muy refinado y un cuidado técnico que va más allá de lo común. [...] Además de la parte técnica, Wellington es una persona tranquila, respetuosa y confiable, que trae ligereza al equipo y entrega con responsabilidad. [...] Recomiendo fuertemente a Wellington para cualquier empresa que busque un profesional comprometido con calidad, usabilidad, rendimiento y que valore el aprendizaje constante. Sin duda, es un profesional con mucho que agregar."
    },
    {
      "author": "Vanessa Vargas",
      "context": "trabajaba con Wellington en el mismo equipo",
      "text": "Trabajé con Wellington en el proyecto MAG Capitalização, y fue una experiencia excelente. Con capacidad analítica y autonomía, enfrenta desafíos de forma estratégica, siempre buscando las mejores soluciones. Tiene gran curiosidad, está constantemente aprendiendo y siempre dispuesto a compartir su conocimiento. Además, tiene un talento natural para crear un ambiente ligero y colaborativo. Su comunicación y su manera desenfadada fortalecen el espíritu del equipo, haciendo el día a día más agradable. Sin duda, un profesional que agrega valor a cualquier equipo."
    },
    {
      "author": "Janilson Coimbra",
      "context": "trabajaba con Wellington en el mismo equipo",
      "text": "Tuve el placer de trabajar con Wellington do Nascimento en ESX/DevLand, y puedo decir que su dominio técnico es un diferencial impresionante. Es un programador altamente capacitado, con buenos enfoques para resolver problemas y una habilidad increíble de transformar desafíos complejos en soluciones eficientes. Recomiendo fuertemente a Wellington para cualquier desafío en el área de tecnología, pues sé que siempre entrega resultados excepcionales."
    }
  ],
  "final_thoughts": {
    "text": "En resumen, siempre fui movido por la curiosidad de entender cómo funcionan las cosas, especialmente en el universo de la tecnología. Durante muchos años, programé sólo por pasión, sin imaginar que podría transformar eso en carrera, dadas las limitaciones de mi contexto. La vida me llevó por diferentes caminos hasta que, finalmente, reencontré mi propósito: dar vida a ideas a través de la programación. Estoy abierto a oportunidades que me permitan retomar esa trayectoria que me mueve. Independientemente del resultado, todo feedback constructivo es bienvenido. Desde ya, agradezco la atención.",
    "author": "Wellington N.",
    "last_updated": "CV actualizado el 03/06/2025"
  }
}
