{
  "personal_info": {
    "name": "Wellington do Nascimento",
    "photo_url": "https://avatars.githubusercontent.com/u/42657376?v=4",
    "linkedin_qr_code_url": "Le PDF contient un code QR qui renvoie probablement vers le profil LinkedIn.",
    "linkedin": "https://linkedin.com/in/wellington-do-nascimento",
    "website": "https://wellnas.dev",
    "phone": "+55 (11) 94201-8873",
    "email": "dev.wellnascimento@gmail.com",
    "age": "26 ans (10/05/1999)",
    "nationality": "Brésilien",
    "location": "Cavalcanti, Rio de Janeiro/RJ"
  },
  "objective": "DÉVELOPPEUR DANS LE DOMAINE DES TI",
  "roles": [
    "DÉVELOPPEUR FULL STACK",
    "FRONT-END",
    "BACK-END",
    "MOBILE"
  ],
  "stack": [
    "NODE",
    "JAVASCRIPT",
    "REACT",
    "NEXT.JS",
    "VUE",
    "C#",
    ".NET CORE",
    "JAVA"
  ],
  "qualifications": {
    "summary": "Plus de 12 ans d'expérience professionnelle dans le domaine du développement full stack, dans les segments de l'expérience utilisateur, de la gestion de projets, du design, du prototypage, des bases de données et de la programmation back-end.",
    "skills": [
      "Facilité d'apprentissage, autodidacte, proactif, réceptif, livraisons de valeur et communication non violente.",
      "Solide connaissance et pratique de Node.js, React, Next.js et CSS/SASS.",
      "Connaissances étendues en sites web, applications mobiles, expérience utilisateur et design responsive.",
      "Vaste expérience et compétence en développement front-end et back-end."
    ]
  },
  "about": {
    "education": "Formation : Enseignement Supérieur - Ingénierie Informatique (prév. 2027/Q2)",
    "languages": "Portugais, anglais (C1), espagnol (B1), italien (A1) et japonais (A2)",
    "development_areas": "Sites web, design responsive, bases de données, serveurs, infrastructure, cloud, VM, automatisation, mobile, UI/UX..."
  },
  "certifications": [
    {
      "title": "Développeur Full Stack",
      "provider": "RECODE Pro",
      "hours": "540h"
    },
    {
      "title": "Architecture Informatique",
      "provider": "Descomplica",
      "hours": "160h"
    },
    {
      "title": "Parcours de Carrière Frontend",
      "provider": "Scrimba",
      "hours": "72h"
    },
    {
      "title": "Parcours de Carrière I.A.",
      "provider": "Scrimba",
      "hours": "72h"
    },
    {
      "title": "Dart & Flutter",
      "provider": "Alura",
      "hours": "48h"
    },
    {
      "title": "Jeux Unity 3D",
      "provider": "Udemy",
      "hours": "128h"
    },
    {
      "title": "jQuery",
      "provider": "Alura",
      "hours": "10h"
    },
    {
      "title": "Parcours Full Stack",
      "provider": "curso.dev",
      "hours": "00"
    },
    {
      "title": "Stratégies UX",
      "provider": "Alura",
      "hours": "8h"
    },
    {
      "title": "UX Basique",
      "provider": "Alura",
      "hours": "32h"
    },
    {
      "title": "React & TypeScript",
      "provider": "Alura",
      "hours": "12h"
    },
    {
      "title": "Conformité et risques",
      "provider": "MAG Group",
      "hours": "12h"
    },
    {
      "title": "Sécurité IT",
      "provider": "Alura",
      "hours": "12h"
    },
    {
      "title": "Loi LGPD (RGPD)",
      "provider": "Bradesco",
      "hours": "2h"
    },
    {
      "title": "Gestion Marketing",
      "provider": "SEST SENAT",
      "hours": "30h"
    }
  ],
  "experience": [
    {
      "company": "DevLand (by ESX)",
      "period": "07/2022 - 03/2025",
      "location": "São Paulo, SP, Brésil - Télétravail",
      "summary": "Prestation de services de développement logiciel en tant que consultant.",
      "roles": [
        {
          "title": "Développeur back-end (.NET C# / Angular) - Groupe MAG",
          "period": "05/2024-03/2025",
          "details": "Rapport aux leaders de l'équipe chez le client, et au leader technique chez le consultant. Responsable du développement d'APIs pour la communication avec la base de données du client, développement d'interfaces pour l'utilisation de ces données dans une équipe intégrée de développement (équipe unique) composée d'environ 10 membres, avec des cérémonies quotidiennes suivant la méthodologie agile SCRUM, proactivité dans la résolution de problèmes, idéalisation, participation, implémentation de nouvelles fonctionnalités, automatisation de processus, autodidaxie, systèmes d'e-commerce, processus de développement et déploiement.",
          "technologies": [".NET Framework", "Selenium", "SQL Server", "Azure", "MS Power Automate", "C#", "Angular.js"]
        },
        {
          "title": "Développeur front-end (VTEX / React) - RESERVA (Groupe AR&CO.)",
          "period": "01/2023 - 04/2024",
          "details": "Responsable de toute la navigation et expérience utilisateur dans l'e-commerce du magasin de textile Reserva, travaillant directement avec VTEX.IO, React et d'autres frameworks pour garantir la qualité et les exigences de livraison. Intervenant directement dans les principales demandes du site comme la page d'accueil, le système de recherche et des activités ponctuelles, comme des ajustements dans le back-end, prototypage dans Figma, etc. Travail avec Master Data, VTEX CLI, JavaScript ES6, React, SASS, APIs et élargissement des fonctionnalités pour d'autres magasins du groupe AR&CO, comme BAW Clothing.",
          "technologies": ["Google Analytics", "Serverless", "SQL Queries", "React", "JavaScript", "TypeScript", "Node", "Knockout.js", "Jest (Tests Unitaires)", "Webpack", "PWA", "React Native", "jQuery", "VTEX.IO", "VTEX CLI", "CSS/SASS", "Google Tag Manager", "Microsoft Clarity", "web:eyez"]
        },
        {
          "title": "Développeur Full Stack - DevLand (by ESX)",
          "details": "Intervention sur les fronts internes de l'entreprise en tant que l'un des premiers développeurs du projet pour des tiers, seul responsable technique du développement du système web et de la page d'atterrissage pour l'obtention de clients potentiels de l'entreprise, volontaire technique pour déblocage des développeurs junior/intermédiaire dans les équipes de l'entreprise, en plus de participer à des initiatives de DevLand comme les applications boutSex et HYLA App.",
          "technologies": ["Dart", "Flutter", "Google Firebase", "Google Analytics", "Serverless", "Vue", "Nuxt3", "React", "JavaScript", "jQuery", "CSS/SASS", "Google Tag Manager"]
        }
      ]
    },
    {
      "company": "Développeur Freelance",
      "period": "2011-2022",
      "location": "Guarulhos, SP, Brésil - Télétravail",
      "summary": "Intervention de bout en bout pour la résolution de diverses demandes des clients.",
      "roles": [
        {
          "title": "Développeur full-stack / Service client",
          "period": "05/2011-06/2022",
          "details": "Création de sites web, web design, création et manipulation d'images, conseil et développement d'identités visuelles et de marques, systèmes d'automatisation et d'auto-service intégrés au site, Discord et WhatsApp, parmi d'autres demandes où j'avais des connaissances ou \"j'apprenais en faisant\" au profit du développement de ma séniorité et de la livraison de valeur au client. J'ai également créé des projets par moi-même à des fins lucratives ou simplement pour aider tout en m'améliorant en codant.",
          "success_cases": "Cas de réussite : La Luna Luana (conception de logo), \"Mi Loja, Tu Loja\" (WordPress), Deltavese (serveur)...",
          "technologies": ["HTML", "CSS", "PHP", "JavaScript", "jQuery", "MySQL", "MongoDB", "Node.js", "Photoshop", "InDesign", "React", "C#", "Oracle Cloud", "AWS", "Java", "Spring Boot", "Vue", "Nuxt3", "WordPress"]
        }
      ]
    }
  ],
  "recommendations": [
    {
      "author": "Thúlio Gamarano",
      "context": "travaillait dans la même équipe et était senior par rapport à Wellington",
      "text": "J'ai eu l'opportunité de travailler avec Wellington pendant un peu plus d'un an chez Reserva, dans une équipe dynamique avec un haut niveau d'exigence technique et esthétique. Dès le début, il a démontré une excellente maîtrise du CSS et un regard aiguisé pour les détails visuels, garantissant que ses livraisons soient toujours fidèles au design, responsives et avec une performance optimale. Il a un sens esthétique très raffiné et un soin technique qui va au-delà du commun. [...] Au-delà de la partie technique, Wellington est une personne tranquille, respectueuse et fiable, qui apporte de la légèreté à l'équipe et livre avec responsabilité. [...] Je recommande fortement Wellington pour toute entreprise qui cherche un professionnel engagé envers la qualité, l'utilisabilité, la performance et qui valorise l'apprentissage constant. Sans aucun doute, il est un professionnel avec beaucoup à apporter."
    },
    {
      "author": "Vanessa Vargas",
      "context": "travaillait avec Wellington dans la même équipe",
      "text": "J'ai travaillé avec Wellington sur le projet MAG Capitalização, et ce fut une excellente expérience. Avec capacité analytique et autonomie, il affronte les défis de manière stratégique, cherchant toujours les meilleures solutions. Il a une grande curiosité, est constamment en train d'apprendre et toujours disposé à partager ses connaissances. De plus, il a un talent naturel pour créer un environnement léger et collaboratif. Sa communication et son approche décontractée renforcent l'esprit d'équipe, rendant le quotidien plus agréable. Sans aucun doute, un professionnel qui ajoute de la valeur à n'importe quelle équipe."
    },
    {
      "author": "Janilson Coimbra",
      "context": "travaillait avec Wellington dans la même équipe",
      "text": "J'ai eu le plaisir de travailler avec Wellington do Nascimento chez ESX/DevLand, et je peux dire que sa maîtrise technique est un différentiel impressionnant. C'est un programmeur hautement qualifié, avec de bonnes approches pour résoudre les problèmes et une capacité incroyable à transformer des défis complexes en solutions efficaces. Je recommande fortement Wellington pour tout défi dans le domaine de la technologie, car je sais qu'il livre toujours des résultats exceptionnels."
    }
  ],
  "final_thoughts": {
    "text": "En résumé, j'ai toujours été motivé par la curiosité de comprendre comment les choses fonctionnent, spécialement dans l'univers de la technologie. Pendant de nombreuses années, j'ai programmé uniquement par passion, sans imaginer que je pourrais transformer cela en carrière, étant donné les limitations de mon contexte. La vie m'a conduit par différents chemins jusqu'à ce que, finalement, je retrouve mon objectif : donner vie aux idées à travers la programmation. Je suis ouvert aux opportunités qui me permettent de reprendre cette trajectoire qui me motive. Indépendamment du résultat, tout retour constructif est bienvenu. Dès maintenant, je vous remercie pour votre attention.",
    "author": "Wellington N.",
    "last_updated": "CV mis à jour le 03/06/2025"
  }
}
