{
  "personal_info": {
    "name": "Веллингтон до Насименто",
    "photo_url": "https://avatars.githubusercontent.com/u/42657376?v=4",
    "linkedin_qr_code_url": "PDF содержит QR-код, который, вероятно, ведет к профилю LinkedIn.",
    "linkedin": "https://linkedin.com/in/wellington-do-nascimento",
    "website": "https://wellnas.dev",
    "phone": "+55 (11) 94201-8873",
    "email": "dev.wellnascimento@gmail.com",
    "age": "26 лет (10/05/1999)",
    "nationality": "Бразилец",
    "location": "Кавалканти, Рио-де-Жанейро/RJ"
  },
  "objective": "ПРОГРАММИСТ В СФЕРЕ ИТ",
  "roles": [
    "FULL STACK РАЗРАБОТЧИК",
    "FRONT-END",
    "BACK-END",
    "MOBILE"
  ],
  "stack": [
    "NODE",
    "JAVASCRIPT",
    "REACT",
    "NEXT.JS",
    "VUE",
    "C#",
    ".NET CORE",
    "JAVA"
  ],
  "qualifications": {
    "summary": "Более 12 лет профессионального опыта в области full stack разработки, включая пользовательский опыт, управление проектами, дизайн, прототипирование, базы данных и back-end программирование.",
    "skills": [
      "Быстрое обучение, самостоятельность, проактивность, восприимчивость, создание ценности и ненасильственная коммуникация.",
      "Глубокие знания и опыт работы с Node.js, React, Next.js и CSS/SASS.",
      "Обширные знания в области веб-сайтов, мобильных приложений, пользовательского опыта и адаптивного дизайна.",
      "Обширный опыт и навыки в front-end и back-end разработке."
    ]
  },
  "about": {
    "education": "Образование: Высшее образование - Компьютерная инженерия (ожид. 2027/Q2)",
    "languages": "Португальский, английский (C1), испанский (B1), итальянский (A1) и японский (A2)",
    "development_areas": "Веб-сайты, адаптивный дизайн, базы данных, серверы, инфраструктура, облако, виртуальные машины, автоматизация, мобильные приложения, UI/UX..."
  },
  "certifications": [
    {
      "title": "Developer Full Stack",
      "provider": "RECODE Pro",
      "hours": "540h"
    },
    {
      "title": "Computer Architecture",
      "provider": "Descomplica",
      "hours": "160h"
    },
    {
      "title": "Frontend Career Path",
      "provider": "Scrimba",
      "hours": "72h"
    },
    {
      "title": "The A.I. Career Path",
      "provider": "Scrimba",
      "hours": "72h"
    },
    {
      "title": "Dart & Flutter",
      "provider": "Alura",
      "hours": "48h"
    },
    {
      "title": "Unity 3D Games",
      "provider": "Udemy",
      "hours": "128h"
    },
    {
      "title": "jQuery",
      "provider": "Alura",
      "hours": "10h"
    },
    {
      "title": "The Full Stack Path",
      "provider": "curso.dev",
      "hours": "00"
    },
    {
      "title": "UX Strategies",
      "provider": "Alura",
      "hours": "8h"
    },
    {
      "title": "UX Basic",
      "provider": "Alura",
      "hours": "32h"
    },
    {
      "title": "React & TypeScript",
      "provider": "Alura",
      "hours": "12h"
    },
    {
      "title": "Compliance and risks",
      "provider": "MAG Group",
      "hours": "12h"
    },
    {
      "title": "IT Security",
      "provider": "Alura",
      "hours": "12h"
    },
    {
      "title": "LGPD Law (GDPR)",
      "provider": "Bradesco",
      "hours": "2h"
    },
    {
      "title": "Marketing Management",
      "provider": "SEST SENAT",
      "hours": "30h"
    }
  ],
  "experience": [
    {
      "company": "DevLand (by ESX)",
      "period": "07/2022 - 03/2025",
      "location": "Сан-Паулу, SP, Бразилия - Удаленно",
      "summary": "Работа в консалтинге, предоставление услуг по разработке программного обеспечения.",
      "roles": [
        {
          "title": "Back-end разработчик (.NET C# / Angular) - MAG Group",
          "period": "05/2024-03/2025",
          "details": "Отчетность руководству команды клиента и техническому лидеру в консалтинговой компании. Отвечал за разработку API для взаимодействия с базой данных клиента, разработку интерфейсов для использования этих данных в интегрированной команде разработчиков (одной команде) из примерно 10 человек, с ежедневными церемониями по методологии SCRUM, проактивностью в решении проблем, идеей, участием, внедрением новых функций, автоматизацией процессов, самообучением, системами электронной коммерции, процессом разработки и развертывания.",
          "technologies": [".NET Framework", "Selenium", "SQL Server", "Azure", "MS Power Automate", "C#", "Angular.js"]
        },
        {
          "title": "Front-end разработчик (VTEX / React) - RESERVA (AR&CO. Group)",
          "period": "01/2023 - 04/2024",
          "details": "Отвечал за всю навигацию и пользовательский опыт в электронной коммерции магазина одежды Reserva, работая напрямую с VTEX.IO, React и другими фреймворками для обеспечения качества и требований к поставкам. Работал непосредственно с основными потребностями сайта, такими как главная страница, система поиска и конкретные действия, такие как настройка back-end, прототипирование в Figma и т.д. Работал с Master Data, VTEX CLI, JavaScript ES6, React, SASS, API и расширением функциональности для других магазинов группы AR&CO, таких как BAW Clothing.",
          "technologies": ["Google Analytics", "Serverless", "SQL Queries", "React", "JavaScript", "TypeScript", "Node", "Knockout.js", "Jest (Unit Testing)", "Webpack", "PWA", "React Native", "jQuery", "VTEX.IO", "VTEX CLI", "CSS/SASS", "Google Tag Manager", "Microsoft Clarity", "web:eyez"]
        },
        {
          "title": "Full Stack разработчик - DevLand (by ESX)",
          "details": "Работал во внутренних направлениях компании как один из первых разработчиков проекта для третьих лиц, единственный технический ответственный за разработку веб-системы и лендинга для привлечения потенциальных клиентов компании, технический волонтер для поддержки младших/средних разработчиков в командах компании, а также участвовал в инициативах DevLand, таких как приложения boutSex и HYLA App.",
          "technologies": ["Dart", "Flutter", "Google Firebase", "Google Analytics", "Serverless", "Vue", "Nuxt3", "React", "JavaScript", "jQuery", "CSS/SASS", "Google Tag Manager"]
        }
      ]
    },
    {
      "company": "Фрилансер",
      "period": "2011-2022",
      "location": "Гуарульюс, SP, Бразилия - Удаленно",
      "summary": "Полный цикл работы для решения различных потребностей клиентов.",
      "roles": [
        {
          "title": "Full Stack разработчик / Обслуживание клиентов",
          "period": "05/2011-06/2022",
          "details": "Создание веб-сайтов, веб-дизайн, создание и манипуляция изображениями, консультации и разработка визуальной идентичности и брендов, системы автоматизации и самообслуживания, интегрированные с веб-сайтом, Discord и WhatsApp, среди других потребностей, где у меня были знания или я \"учился делая\" для развития своего профессионализма и предоставления ценности клиенту. Я также создавал собственные проекты для получения прибыли или просто помощи, одновременно совершенствуя свои навыки кодирования.",
          "success_cases": "Успешные кейсы: La Luna Luana (дизайн логотипа), \"Mi Loja, Tu Loja\" (WordPress), Deltavese (сервер)...",
          "technologies": ["HTML", "CSS", "PHP", "JavaScript", "jQuery", "MySQL", "MongoDB", "Node.js", "Photoshop", "InDesign", "React", "C#", "Oracle Cloud", "AWS", "Java", "Spring Boot", "Vue", "Nuxt3", "WordPress"]
        }
      ]
    }
  ],
  "recommendations": [
    {
      "author": "Thúlio Gamarano",
      "context": "работал в той же команде и был старшим по отношению к Веллингтону",
      "text": "Мне посчастливилось работать с Веллингтоном чуть больше года в Reserva в динамичной команде с высокими техническими и эстетическими требованиями. С самого начала он продемонстрировал отличное владение CSS и острый глаз к визуальным деталям, обеспечивая, чтобы его работы всегда были верны дизайну, адаптивны и с отличной производительностью. У него очень развитое эстетическое чувство и техническая тщательность, которая выходит за рамки обычного. [...] Помимо технической части, Веллингтон спокойный, уважительный и надежный человек, который приносит легкость в команду и ответственно выполняет работу. [...] Я настоятельно рекомендую Веллингтона любой компании, которая ищет профессионала, приверженного качеству, удобству использования, производительности и ценящего постоянное обучение. Несомненно, он профессионал, способный многое привнести."
    },
    {
      "author": "Vanessa Vargas",
      "context": "работала с Веллингтоном в той же команде",
      "text": "Я работала с Веллингтоном над проектом MAG Capitalização, и это был отличный опыт. С аналитическими способностями и автономией, он стратегически подходит к вызовам, всегда ищет наилучшие решения. У него большая любознательность, он постоянно учится и всегда готов поделиться своими знаниями. Кроме того, у него естественный талант создавать легкую и совместную атмосферу. Его общение и непринужденный стиль укрепляют командный дух, делая повседневность более приятной. Без сомнения, профессионал, который добавляет ценность любой команде."
    },
    {
      "author": "Janilson Coimbra",
      "context": "работал с Веллингтоном в той же команде",
      "text": "Мне посчастливилось работать с Веллингтоном до Насименто в ESX/DevLand, и я могу сказать, что его техническое мастерство — впечатляющее отличие. Он высококвалифицированный программист с хорошими подходами к решению проблем и невероятной способностью превращать сложные задачи в эффективные решения. Я настоятельно рекомендую Веллингтона для любых задач в области технологий, поскольку знаю, что он всегда обеспечивает исключительные результаты."
    }
  ],
  "final_thoughts": {
    "text": "В итоге, мной всегда двигало любопытство понять, как работают вещи, особенно в мире технологий. На протяжении многих лет я программировал только из страсти, не представляя, что это может стать карьерой, учитывая ограничения моей ситуации. Жизнь вела меня разными путями, пока, наконец, я не нашел свою цель: воплощать идеи через программирование. Я открыт для возможностей, которые позволят мне продолжить этот путь, который меня вдохновляет. Независимо от результата, любая конструктивная обратная связь приветствуется. Заранее благодарю за внимание.",
    "author": "Веллингтон Н.",
    "last_updated": "Резюме обновлено 03/06/2025"
  }
}
